app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is a test message"], ["user_id", 6], ["created_at", "2020-01-30 09:56:41.170494"], ["updated_at", "2020-01-30 09:56:41.170494"]]
---
    def create
      message = current_user.messages.build(message_params)
      if message.save